In [25]:
import pandas as pd
import numpy as np

DataFrame 만들기

In [9]:
dict = {'Name': ['Gildong', 'Sarang', 'Jiemae', 'Yeoin', 'James', 'Sen'],
        'Grade': [1, 3, 4, 2, 3, 4],
        'Score': [56000, 23000, 44000, 52000, 52000, 60000]}
df = pd.DataFrame(dict)
print(df)

      Name  Grade  Score
0  Gildong      1  56000
1   Sarang      3  23000
2   Jiemae      4  44000
3    Yeoin      2  52000
4    James      3  52000
5      Sen      4  60000

## 데이터프레임 변경

**열 이름 변경**
1. columns
    * 모든 컬럼 이름을 변경

2. rename
    * 변경할 이름의 컬럼만 지정

- columns

In [3]:
df.columns = ['name', 'grade','score']

In [4]:
df

      name  grade  score
0  Gildong      1  56000
1   Sarang      3  23000
2   Jiemae      4  44000
3    Yeoin      2  52000
4    James      3  52000
5      Sen      4  60000

- rename

In [5]:
df.rename(columns = {'name':'Name'})

      Name  grade  score
0  Gildong      1  56000
1   Sarang      3  23000
2   Jiemae      4  44000
3    Yeoin      2  52000
4    James      3  52000
5      Sen      4  60000

**열 삭제**
  * drop() 매소드를 사용
    * aixs = 0 : 행 삭제(기본값)
    * axis = 1: 열 삭제
    * inplace = False: 삭제한 것처럼 조회
    * inplace = True: 진짜 삭제

In [35]:
df1 = df.copy()

In [36]:
df1.drop(['Name','Score'],axis = 1, inplace = True)
df1

   Grade
0      1
1      3
2      4
3      2
4      3
5      4

**값 변경**

In [27]:
df1 = df.copy()

In [11]:
# 열 전체 값 변경
df1['Score'] = 0
df1

      Name  Grade  Score
0  Gildong      1      0
1   Sarang      3      0
2   Jiemae      4      0
3    Yeoin      2      0
4    James      3      0
5      Sen      4      0

In [22]:
# 조건에 의한 변경1
df1.loc[df1['Score'] > 59000, 'Score'] = 0
df1

      Name  Grade  Score
0  Gildong      1  56000
1   Sarang      3  23000
2   Jiemae      4  44000
3    Yeoin      2  52000
4    James      3  52000
5      Sen      4      0

In [34]:
# 조건에 의한 변경2
df1['Score'] = np.where(df1['Score'] > 55000, 1, 0)
df1

      Name  Grade  Score
0  Gildong      1      1
1   Sarang      3      0
2   Jiemae      4      0
3    Yeoin      2      0
4    James      3      0
5      Sen      4      1

- **df.map({'기존값': 새로운 값)**
    - 범주형 값을 다른 값으로 변경

In [41]:
df1 = df.copy()

In [42]:
df1['Name'] = df1['Name'].map({'Sen':1, 'James':2, 'Yeoin':3, 'Jiemae':4, 'Sarang': 5, 'Gildong':6})
df1

   Name  Grade  Score
0     6      1  56000
1     5      3  23000
2     4      4  44000
3     3      2  52000
4     2      3  52000
5     1      4  60000

- **cut()**
    * 숫자형 변수를 범주형 변수로 변환
    * bins로 원하는 범위 설정 가능
    * bins 내 범위는 (a, b] : a초과 b 이하의 값
    * right = False: [a, b) -> a이상 b 미만의 값

In [94]:
df1 = df.copy()

In [86]:
df1['Score'] = pd.cut(df1['Score'], 3 , labels = ['C','B','A'])
df1

      Name  Grade Score
0  Gildong      1     A
1   Sarang      3     C
2   Jiemae      4     B
3    Yeoin      2     A
4    James      3     A
5      Sen      4     A

In [93]:
df1['Score'] = pd.cut(df1['Score'], bins =[22000, 56000, 60000] , labels = ['B','A'])
df1

      Name  Grade Score
0  Gildong      1     B
1   Sarang      3     B
2   Jiemae      4     B
3    Yeoin      2     B
4    James      3     B
5      Sen      4     A

In [95]:
df1['Score'] = pd.cut(df1['Score'], bins =[22000, 56000, 61000] , labels = ['B','A'], right = False)
df1

      Name  Grade Score
0  Gildong      1     A
1   Sarang      3     B
2   Jiemae      4     B
3    Yeoin      2     B
4    James      3     B
5      Sen      4     A

## 데이터 프레임 결합

1. concat() :
    * 매핑기준: **인덱스(행), 컬럼이름(열)**
    * 구조를 기준으로 합침
   
2. merge() :
    * 매핑 기준: **특정 칼럼(key)의 값** 기준으로 결합
    * 데이터베이스 Join과 같음

In [70]:
dict1 = {'Name': ['Gildong', 'Sarang', 'Jiemae', 'Yeoin', 'James', 'Sen'],
        'Grade': [1, 3, 4, 2, 3, 4],
        'Score': [56000, 23000, 44000, 52000, 52000, 60000]}
df1 = pd.DataFrame(dict1)

dict2 = {'Name': ['Gildong', 'Sara', 'Jiemae', 'Yeoin', 'James', 'Sen'],
        'subject': ['math', 'English', 'English','Korean', 'Science', 'math'],
        'age': [20, 22, 23, 21, 22, 23]}
df2 = pd.DataFrame(dict2)

- concat()
    * axis = 0: 세로로 합치기, 컬럼의 구조가 같아야함
    * axis = 1: 가로로 합치기, 구조가 같아야함, 인덱스 기준
    
    * 방법 선택
        * join = 'outer': 모든 행과 열 합치기(default)
        * join = 'inner': 매핑되는 행과 열만 합치기(교집합)

(1) axis = 1

In [71]:
pd.concat([df1, df2], axis=1, join = 'inner')

      Name  Grade  Score     Name  subject  age
0  Gildong      1  56000  Gildong     math   20
1   Sarang      3  23000     Sara  English   22
2   Jiemae      4  44000   Jiemae  English   23
3    Yeoin      2  52000    Yeoin   Korean   21
4    James      3  52000    James  Science   22
5      Sen      4  60000      Sen     math   23

In [74]:
pd.concat([df1, df2], axis=1, join = 'outer')

      Name  Grade  Score     Name  subject  age
0  Gildong      1  56000  Gildong     math   20
1   Sarang      3  23000     Sara  English   22
2   Jiemae      4  44000   Jiemae  English   23
3    Yeoin      2  52000    Yeoin   Korean   21
4    James      3  52000    James  Science   22
5      Sen      4  60000      Sen     math   23

(2) axis = 0

In [68]:
pd.concat([df1, df2], axis=0, join = 'inner')

      Name
0  Gildong
1   Sarang
2   Jiemae
3    Yeoin
4    James
5      Sen
0  Gildong
1     Sara
2   Jiemae
3    Yeoin
4    James
5      Sen

In [73]:
pd.concat([df1, df2], axis=0, join = 'outer')

      Name  Grade    Score  subject   age
0  Gildong    1.0  56000.0      NaN   NaN
1   Sarang    3.0  23000.0      NaN   NaN
2   Jiemae    4.0  44000.0      NaN   NaN
3    Yeoin    2.0  52000.0      NaN   NaN
4    James    3.0  52000.0      NaN   NaN
5      Sen    4.0  60000.0      NaN   NaN
0  Gildong    NaN      NaN     math  20.0
1     Sara    NaN      NaN  English  22.0
2   Jiemae    NaN      NaN  English  23.0
3    Yeoin    NaN      NaN   Korean  21.0
4    James    NaN      NaN  Science  22.0
5      Sen    NaN      NaN     math  23.0

- merge()
    - 방법 선택
        - how = 'outer', 'inner', 'right', 'left'

In [75]:
pd.merge(df1, df2, how = 'left', on = 'Name')

      Name  Grade  Score  subject   age
0  Gildong      1  56000     math  20.0
1   Sarang      3  23000      NaN   NaN
2   Jiemae      4  44000  English  23.0
3    Yeoin      2  52000   Korean  21.0
4    James      3  52000  Science  22.0
5      Sen      4  60000     math  23.0

In [76]:
pd.merge(df1, df2, how = 'right', on = 'Name')

      Name  Grade    Score  subject  age
0  Gildong    1.0  56000.0     math   20
1     Sara    NaN      NaN  English   22
2   Jiemae    4.0  44000.0  English   23
3    Yeoin    2.0  52000.0   Korean   21
4    James    3.0  52000.0  Science   22
5      Sen    4.0  60000.0     math   23

In [77]:
pd.merge(df1, df2, how = 'inner', on = 'Name')

      Name  Grade  Score  subject  age
0  Gildong      1  56000     math   20
1   Jiemae      4  44000  English   23
2    Yeoin      2  52000   Korean   21
3    James      3  52000  Science   22
4      Sen      4  60000     math   23

In [78]:
pd.merge(df1, df2, how = 'outer', on = 'Name')

      Name  Grade    Score  subject   age
0  Gildong    1.0  56000.0     math  20.0
1   Sarang    3.0  23000.0      NaN   NaN
2   Jiemae    4.0  44000.0  English  23.0
3    Yeoin    2.0  52000.0   Korean  21.0
4    James    3.0  52000.0  Science  22.0
5      Sen    4.0  60000.0     math  23.0
6     Sara    NaN      NaN  English  22.0

**pivot**
- 집계 후 데이터프레임 구조 변형하여 조회

In [81]:
df1.pivot('Name', 'Grade', 'Score')

Grade          1        2        3        4
Name
Gildong  56000.0      NaN      NaN      NaN
James        NaN      NaN  52000.0      NaN
Jiemae       NaN      NaN      NaN  44000.0
Sarang       NaN      NaN  23000.0      NaN
Sen          NaN      NaN      NaN  60000.0
Yeoin        NaN  52000.0      NaN      NaN